app/views/restaurants/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
              <td>
                <h4><%= "#{r.user.first_name.capitalize} #{r.user.last_name.capitalize[0]}." %></h4>