app/controllers/restaurants_controller.rb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = ?  ORDER BY reviews.created_at DESC  [["restaurant_id", 2]]
SELECT AVG("reviews"."rating") FROM "reviews" WHERE "reviews"."restaurant_id" = ?  [["restaurant_id", 2]]
---
  def show
      @reviews = Review.where(restaurant_id: @restaurant.id).order('reviews.created_at DESC')
      if @reviews.blank?
        @avg_rating = 0
      else
        @avg_rating = @reviews.average(:rating).round(2)

INSERT INTO "restaurants" ("name", "address", "phone", "website", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @restaurant = Restaurant.new(restaurant_params)

    respond_to do |format|
      if @restaurant.save

UPDATE "restaurants" SET "image" = ?, "updated_at" = ? WHERE "restaurants"."id" = ?  [["image", "IMG_0901.PNG"], ["updated_at", "2015-05-21 06:02:52.771298"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @restaurant.update(restaurant_params)