app/controllers/reviews_controller.rb

  def create
    @review = Review.new(review_params)
    @review.user_id = current_user.id
    @review.restaurant_id = @restaurant.id
    respond_to do |format|
      if @review.save
---
INSERT INTO "reviews" ("rating", "comment", "user_id", "restaurant_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 5], ["comment", "awesome palce"], ["user_id", 1], ["restaurant_id", 3], ["created_at", "2015-05-23 12:15:15.561825"], ["updated_at", "2015-05-23 12:15:15.561825"]]

    def set_restaurant
      @restaurant = Restaurant.find(params[:restaurant_id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", 2]]